module.exports = {
    regions: {
        "A": "По мicту",
        "B": "Безпечній області",
        "C": "По країні",
        "D": "Oкупованим територіям",
    },
    districts: {
        "A": "Александровський",
        "B": "Заводский",
        "C": "Комунарський",
        "D": "Днепровський",
        "E": "Вознiсеновський",
        "F": "Хортицький",
        "G": "Шевченковський",
    },
    microdistrics: {
        "A": ["Старе мiсто"],
        "B": ["Павло-Кiчкас", "Запорiжжя лiве","Теплiчне"],
        "C": ["Космiчний", "Пiвденний", "Друготравневе селище", "Першотравневе селище", "Мирне селище", "Миколаївське селище"],
        "D": ["Бородинський", "Осiпенковський", "Верхня Хортиця", "Соцмicто", "Бомбей", "Великий луг"],
        "E": ["Овочівників", "Селище Садоводів", "Селище Старий Дніпро", "Селище Запорізька січ", "Наукове містечко", "Селище Лісництво"],
        "F": ["Селище Мостозагін", "17-ий Хортицький", "3-iй Хортицький", "5-ий Хортицький", "6-ий Хортицький"],
        "G": ["Зелений Яр", "Калантирiвка", "Чкаловский", "Селище ДД", "2-й Шевченківський", "Гортоп", "Мокрянка", "26-ий квартал", "Леваневського", "Воэнне мiстечко"]
    },
    toENG(text) {
        text = text.toUpperCase();
        let eng = {
            'А': 'A',
            'В': 'B',
            'Е': 'E',
            'К': 'K',
            'Н': 'H',
            'Р': 'P',
            'С': 'C',
            'Т': 'T',
            'І': 'I',
            'М': 'M',
            'О': 'O',
            'Х': 'X'
        };

        for (let i in eng) {
            text = text.replace(new RegExp(i, 'g'), eng[i]);
        }
        return text;
    },
}